microchip-pic-avr-examples/dspic33ck-power-dcdc-dual-active-bridge-development-platform/dspic33ck-dab.X/sources/pwrctrl/pwrctrl_isr_extension.c

/**
 * @file      pwrctrl_isr_extension.c
 * @ingroup   pwrctrl-isr   
 * @brief     Contains some of the functions used in the interrupt service routine
 *  of control loop.
 */

#include <xc.h>
#include <math.h>
#include <stdbool.h>
#include <stdlib.h>

// MCC header files
#include "adc/adc_types.h"
#include "adc/adc1.h"
#include "system/pins.h"

// DAB header files
#include "config/macros.h"
#include "config/config.h"
#include "pwrctrl.h"
#include "fault/fault.h"
#include "dcdt/pwrctrl_dcdt.h"

    
/*******************************************************************************
 * @ingroup pwrctrl-isr
 * @brief Data Object of primary voltage averaging
 * 
 * @details The 'VprimAveraging' data object holds the averaging parameter of the 
 *  Primary Voltage.
 *******************************************************************************/
AVERAGING_t vPrimAveraging;
/*******************************************************************************
 * @ingroup pwrctrl-isr
 * @brief Data Object of secondary voltage averaging
 * 
 * @details The 'VsecAveraging' data object holds the averaging parameter of the 
 *  Secondary Voltage.
 *******************************************************************************/
AVERAGING_t vSecAveraging;
/*******************************************************************************
 * @ingroup pwrctrl-isr
 * @brief Data Object of secondary current averaging
 * 
 * @details The 'IsecAveraging' data object holds the averaging parameter of the 
 *  Secondary Current.
 *******************************************************************************/
AVERAGING_t iSecAveraging;

// STATIC VARIABLES and FUNCTIONS
static void PwrCtrl_AdaptiveGainUpdate(void);
static bool VLoopInterleaveExec = true;

/*******************************************************************************
 * @ingroup pwrctrl-isr
 * @brief  This function updates the DAB data members with ADC raw values
 * @return void
 * 
 * @details This function is called every 100KHz and triggers the ADC module. This
 *  also handles the updating of DAB data members with its latest ADC raw values
 *  and collection of data for averaging.
 *********************************************************************************/
void PwrCtrl_UpdateADConverterData (void)
{        
    // Enable the ADC sampling
    ADC1_SoftwareTriggerEnable();
    
    if(ADC1_IsConversionComplete(ISEC_CT))
        dab.Data.ISenseSecondary = ADC1_ConversionResultGet(ISEC_CT); 
    
    if(ADC1_IsConversionComplete(IPRI_CT))
        dab.Data.ISensePrimary = ADC1_ConversionResultGet(IPRI_CT);   
    
    if(ADC1_IsConversionComplete(VRAIL_5V))
        dab.Data.VRail_5V = ADC1_ConversionResultGet(VRAIL_5V);
    
    if(ADC1_IsConversionComplete(TEMP))
        dab.Data.Temperature = ADC1_ConversionResultGet(TEMP);
    
    if(ADC1_IsConversionComplete(VPRI)){
        dab.Data.VPriVoltage = ADC1_ConversionResultGet(VPRI);
        vPrimAveraging.Accumulator += dab.Data.VPriVoltage;
        vPrimAveraging.Counter = vPrimAveraging.Counter + 1;   
    }
    
    if(ADC1_IsConversionComplete(VSEC)){
        dab.Data.VSecVoltage = ADC1_ConversionResultGet(VSEC);
        vSecAveraging.Accumulator += dab.Data.VSecVoltage;
        vSecAveraging.Counter = vSecAveraging.Counter + 1; 
    }
    
    if(ADC1_IsConversionComplete(ISEC_AVG)){
        dab.Data.ISecAverage = ADC1_ConversionResultGet(ISEC_AVG); 
        dab.Data.ISecAverageRectified = abs(dab.Data.ISecAverage - dab.Data.ISecSensorOffset);
        iSecAveraging.Accumulator += dab.Data.ISecAverageRectified;
        iSecAveraging.Counter = iSecAveraging.Counter + 1;
    }
}

/*******************************************************************************
 * @ingroup pwrctrl-isr
 * @brief  This function prepares the data for control loop and selects which 
 *  control loop will be executed. 
 * @return void
 * 
 * @details This function prepares the data for Voltage loop control and Power
 *  loop control. The enable bit of these control loops are manage in this function 
 *  in which the VLoop and PLoop are enabled at 10KHz with 180 degrees phase. 
 *********************************************************************************/
void PwrCtrl_10KHzVPLoopPrepareData(void)
{
    static uint16_t cnt = 0;
    
    //Interleave the execution of VLoop and PLoop control for 10KHz execution
    if(++cnt == (VPLOOP_ILOOP_EXE_RATIO)) 
    {
        // Averaging of Secondary Voltage
        vSecAveraging.AverageValue = (uint16_t)(__builtin_divud(vSecAveraging.Accumulator, vSecAveraging.Counter));
        vSecAveraging.Accumulator = 0;
        vSecAveraging.Counter = 0;
        
        
        // Averaging of Primary Voltage
        vPrimAveraging.AverageValue = (uint16_t)(__builtin_divud(vPrimAveraging.Accumulator, vPrimAveraging.Counter));
        vPrimAveraging.Accumulator = 0;
        vPrimAveraging.Counter = 0;
            
            
        #if(OPEN_LOOP_PBV == false)
        //Condition for control loop execution controlling the loop enable bit
        if((dab.VLoop.Enable == false) && (VLoopInterleaveExec == true) && (dab.Status.bits.Running == 1))
        #endif  
        {
            // Enable Vloop control
            dab.VLoop.Enable = true;
            dab.PLoop.Enable = false;
            // Compute the Adaptive Gain 
            PwrCtrl_AdaptiveGainUpdate();
        }
 
        #if(OPEN_LOOP_PBV == false)
        else if((dab.PLoop.Enable == false) && (VLoopInterleaveExec == false) && (dab.Status.bits.Running == 1))
        #endif
        {
            // Enable PLoop control
            dab.VLoop.Enable = false;
            dab.PLoop.Enable = true;
        
            // Averaging of Secondary Current
            iSecAveraging.AverageValue = (uint16_t)(__builtin_divud(iSecAveraging.Accumulator, iSecAveraging.Counter));
            iSecAveraging.Accumulator = 0;
            iSecAveraging.Counter = 0;
            
            // Bit-shift value used to perform input value normalization
            // Scaled the feedback to Power (Watts in units)
            uint32_t buf = (uint32_t)iSecAveraging.AverageValue * 
                    (uint32_t)vSecAveraging.AverageValue * POWER_FACTOR; 

