microchip-pic-avr-examples/dspic33ck-power-dcdc-dual-active-bridge-development-platform/dspic33ck-dab.X/sources/pwrctrl/pwrctrl_isr_extension.c
            // scale back the 14 bit from the POWER_RESOLUTION calculation 
            // to get the Watts value for Power Loop
            buf >>= POWER_SCALER;

            // Transfer to SecPower data member the power computation in [Watts] 
            dab.Data.SecPower = buf;
        
        }
        
        // If Power supply is not yet running, the averaging of
        // primary voltage and secondary voltage continues to display in PBV
        if(!dab.Status.bits.Running){

            // Averaging of Secondary Current
            iSecAveraging.AverageValue = (uint16_t)(__builtin_divud(iSecAveraging.Accumulator, iSecAveraging.Counter));
            iSecAveraging.Accumulator = 0;
            iSecAveraging.Counter = 0;
            
            // Bit-shift value used to perform input value normalization
            // Scaled the feedback to Power (Watts in units)
            uint32_t buf = (uint32_t)iSecAveraging.AverageValue * 
                    (uint32_t)vSecAveraging.AverageValue * POWER_FACTOR; 

            // scale back the 14 bit from the POWER_RESOLUTION calculation 
            // to get the Watts value for Power Loop
            buf >>= POWER_SCALER;

            // Transfer to SecPower data member the power computation in [Watts] 
            dab.Data.SecPower = buf;
        }
        
        cnt = 0;
    }
}

/*******************************************************************************
 * @ingroup pwrctrl-isr
 * @brief Executes the power converter control loop 
 * @return void
 * 
 * @details This function is called to execute the control loop of the power
 *  converter. It comprise of Voltage Loop control (VLoop), Power Loop control (PLoop) 
 *  and Current Loop Control (ILoop). Vloop and PLoop is ten times slower than
 *  the current loop with interleaved execution while Iloop is executed every time 
 *  this function is called.  
 *********************************************************************************/
void PwrCtrl_ControlLoopExecute(void)
{   
    

    // Execute the Voltage Loop Control
    if((dab.VLoop.Enable == true) && (VLoopInterleaveExec == true))
    {     
        VLoopInterleaveExec = false;
        
        if(dab.PowerDirection == PWR_CTRL_CHARGING)
        { 
            VMC_2p2z.KfactorCoeffsB = 0x7FFF;
            VMC_2p2z.maxOutput =  0x7FFF;

            // Bit-shift value used to perform input value normalization
            dab.VLoop.Feedback = vSecAveraging.AverageValue << 3;  
            dab.VLoop.Reference = (dab.VLoop.Reference << 3);

            // Execute the Voltage Loop Control OutP
            XFT_SMPS_Controller2P2ZUpdate(&VMC_2p2z, &dab.VLoop.Feedback,dab.VLoop.Reference, &dab.VLoop.Output);

            // Reset the Vloop reference to its original scaling
            dab.VLoop.Reference = (dab.VLoop.Reference >> 3);
            
#if VLOOP_K_TEST
            {    
                if ((dab.VLoop.Reference + 100 )> vSecAveraging.AverageValue)
                {
                    dab.VLoop.Output = 40 * (dab.VLoop.Reference - vSecAveraging.AverageValue);// << 2; 
                }
                else
                {
                    dab.VLoop.Output = 0;
                }
            }
#endif        
        }

        
        if(dab.PowerDirection == PWR_CTRL_DISCHARGING)
        { 
            VMC_2p2z_Rev.KfactorCoeffsB = 0x7FFF;
            VMC_2p2z_Rev.maxOutput =  0x7FFF;

            // Bit-shift value used to perform input value normalization
            dab.VLoop.Feedback = vPrimAveraging.AverageValue << 3;  
            dab.VLoop.Reference = (dab.VLoop.Reference << 3);//should be limited range or even fixed for GTI input

            // Execute the Voltage Loop Control
            XFT_SMPS_Controller2P2ZUpdate(&VMC_2p2z_Rev, &dab.VLoop.Feedback,
                    dab.VLoop.Reference, &dab.VLoop.Output);

            // Reset the Vloop reference to its original scaling
            dab.VLoop.Reference = (dab.VLoop.Reference >> 3);
            
            
#if VLOOP_K_TEST
            {    
                if ((dab.VLoop.Reference + 100 )> vPrimAveraging.AverageValue)
                {
                   dab.VLoop.Output = 40 * (dab.VLoop.Reference - vPrimAveraging.AverageValue);// << 2; 
                }
                else
                {
                    dab.VLoop.Output = 0;
                }
            }
#endif   
        }
        dab.VLoop.Output = dab.VLoop.Output & 0x7FFF;
    }


    // Execute the Power Loop Control
    if((dab.PLoop.Enable == true) && (VLoopInterleaveExec == false))
    {      
        if(dab.PowerDirection == PWR_CTRL_CHARGING)
        { 
            VLoopInterleaveExec = true;

            dab.PLoop.Feedback = dab.Data.SecPower;
            dab.PLoop.Reference = dab.PLoop.Reference;

            // Execute the Power Loop Control
            SMPS_Controller2P2ZUpdate(&PMC_2p2z, &dab.PLoop.Feedback,
                    dab.PLoop.Reference, &dab.PLoop.Output);
        }
        

        if(dab.PowerDirection == PWR_CTRL_DISCHARGING)
        {
            VLoopInterleaveExec = true;

            dab.PLoop.Feedback = dab.Data.SecPower;
            dab.PLoop.Reference = dab.PLoop.Reference;

            // Execute the Power Loop Control
            SMPS_Controller2P2ZUpdate(&PMC_2p2z_Rev, &dab.PLoop.Feedback,
                    dab.PLoop.Reference, &dab.PLoop.Output);
        }
        
        dab.PLoop.Output = dab.PLoop.Output & 0x7FFF;
    }

    // Execute the Current Loop Control
    if(dab.ILoop.Enable == true)
    {
        DPD_TP31_SetHigh();//Test/dbg purpose only
        //Bit-shift value used to perform input value normalization
        dab.ILoop.Feedback = dab.Data.ISecAverageRectified << 3;
        //adaptive gain factor
        IMC_2p2z.KfactorCoeffsB = dab.ILoop.AgcFactor;
        IMC_2p2z_Rev.KfactorCoeffsB = dab.ILoop.AgcFactor;
        //refresh limits
        IMC_2p2z.maxOutput =  0x7FFF;


        
        if(dab.PowerDirection == PWR_CTRL_CHARGING)
        { 
            // Mixing stage from voltage loop 10KHz
            uint32_t RefBuf = (uint32_t)(dab.ILoop.Reference) * (uint32_t)(dab.VLoop.Output & 0x7FFF);
            uint16_t ILoopReference = (uint16_t)(RefBuf >> 12); 

